Ebiroll/qemu_esp32/examples/32_radiohead/components/RadioHead/RadioHead.h
///              such Sparkfun nRF52832 breakout board, with Arduino 1.6.13 and
///              Sparkfun nRF52 boards manager 0.2.3 using the procedures outlined in
///              https://learn.sparkfun.com/tutorials/nrf52832-breakout-board-hookup-guide<br>
///              Caution, the Sparkfun development system for Arduino is still immature. We had to 
///              rebuild the nrfutil program since the supplied one was not suitable for 
///              the Linux host we were developing on. See https://forum.sparkfun.com/viewtopic.php?f=32&t=45071
///              Also, after downloading a sketch in the nRF52832, the program does not start executing cleanly: 
///              you have to reset the processor again by pressing the reset button. 
///              This appears to be a problem with nrfutil, rather than a bug in RadioHead.
/// \version 1.66 2017-01-15
///              Fixed some errors in (unused) register definitions in RH_RF95.h.<br>
///              Fixed a problem that caused compilation errors in RH_NRF51 if the appropriate board 
///              support was not installed.
/// \version 1.67 2017-01-24
///              Added RH_RF95::frequencyError() to return the estimated centre frequency offset in Hz 
///              of the last received message
/// \version 1.68 2017-01-25
///              Fixed arithmetic error in RH_RF95::frequencyError() for some platforms.
/// \version 1.69 2017-02-02
///              Added RH_RF95::lastSNR() and improved lastRssi() calculations per the manual.
/// \version 1.70 2017-02-03
///              Added link to Binpress commercial license purchasing.
/// \version 1.71 2017-02-07
///              Improved support for STM32. Patch from Bent Guldbjerg Christensen.
/// \version 1.72 2017-03-02
///              In RH_RF24, fixed a problem where some important properties were not set by the ModemConfig.
///              Added properties 2007, 2008, 2009. Also properties 200a was not being set in the chip.
///              Reported by Shannon Bailey and Alan Adamson.
///              Fixed corresponding convert.pl and added it to the distribution.
/// \version 1.73 2017-03-04
///              Significant changes to RH_RF24 and its API. It is no longer possible to change the modulation scheme
///              programatically: it proved impossible to cater for all the possible crystal frequencies,
///              base frequency and modulation schemes. Instead you can use one of a small set of supplied radio
///              configuration header files, or generate your own with Silicon Labs WDS application. Changing
///              modulation scheme required editing RH_RF24.cpp to specify the appropriate header and recompiling.
///              convert.pl is now redundant and removed from the distribution.
/// \version 1.74 2017-03-08
///              Changed RHReliableDatagram so it would not ACK messages heard addressed to other nodes
///              in promiscuous mode.<br>
///              Added RH_RF24::deviceType() to return the integer value of the connected device.<br>
///              Added documentation about how to connect RFM69 to an ESP8266. Tested OK.<br>
///              RH_RF24 was not correctly changing state in sleep() and setModeIdle().<br>
///              Added example rf24_lowpower_client.pde showing how to put an arduino and radio into a low power
///              mode between transmissions to save battery power.<br>
///              Improvements to RH_RF69::setTxPower so it now takes an optional ishighpowermodule
///              flag to indicate if the connected module is a high power RFM69HW, and so set the power level
///              correctly. Based on code contributed by bob.
/// \version 1.75 2017-06-22
///              Fixed broken compiler issues with RH_RF95::frequencyError() reported by Steve Rogerson.<br>
///              Testing with the very excellent Rocket Scream boards equipped with RF95 TCXO modules. The
///              temperature controlled oscillator stabilises the chip enough to be able to use even the slowest
///              protocol Bw125Cr48Sf4096. Caution, the TCXO model radios are not low power when in sleep (consuming
///              about ~600 uA, reported by Phang Moh Lim).<br>
///              Added support for EBYTE E32-TTL-1W and family serial radio transceivers. These RF95 LoRa based radios
///              can deliver reliable messages at up to 7km measured.
/// \version 1.76 2017-06-23
///              Fixed a problem with RH_RF95 hanging on transmit under some mysterious circumstances.
///              Reported by several people at  https://forum.pjrc.com/threads/41878-Probable-race-condition-in-Radiohead-library?p=146601#post146601 <br>
///              Increased the size of rssi variables to 16 bits to permit RSSI less than -128 as reported by RF95.
/// \version 1.77 2017-06-25
///              Fixed a compilation error with lastRssi().<br>
/// \version 1.78 2017-07-19
///              Fixed a number of unused variable warnings from g++.<br>
///              Added new module RHEncryptedDriver and examples, contributed by Philippe Rochat, which
///              adds encryption and decryption to any RadioHead transport driver, using any encryption cipher
///              supported by ArduinoLibs Cryptographic Library http://rweather.github.io/arduinolibs/crypto.html
///              Includes several examples.<br>
/// \version 1.79 2017-07-25
///              Added documentation about 'Passing Sensor Data Between RadioHead nodes'.<br>
///              Changes to RH_CC110 driver to calculate RSSI in dBm, based on a patch from Jurie Pieterse.<br>
///              Added missing passthroughmethoids to RHEncryptedDriver, allowing it to be used with RHDatagram,
///              RHReliableDatagram etc. Tested with RH_Serial. Added examples
/// \version 1.80 2017-10-04
///              Testing with the very fine Talk2 Whisper Node LoRa boards https://wisen.com.au/store/products/whisper-node-lora
///              an Arduino compatible board, which include an on-board RFM95/96 LoRa Radio (Semtech SX1276), external antenna, 
///              run on 2xAAA batteries and support low power operations. RF95 examples work without modification.
///              Use Arduino Board Manager to install the Talk2 code support. Upload the code with an FTDI adapter set to 5V.<br>
///              Added support for SPI transactions in development environments that support it with SPI_HAS_TRANSACTION.
///              Tested on ESP32 with RFM-22 and Teensy 3.1 with RF69
///              Added support for ESP32, tested with RFM-22 connected by SPI.<br>
/// 
///\version 1.81 2017-11-15
///              RH_CC110, moved setPaTable() from protected to public.<br>
///              RH_RF95 modem config Bw125Cr48Sf4096 altered to enable slow daat rate in register 26
///              as suggested by Dieter Kneffel.
///              Added support for nRF52 compatible Arm chips such as as Adafruit BLE Feather board
///              https://www.adafruit.com/product/3406, with a patch from Mike Bell.<br>
///              Fixed a problem where rev 1.80 broke Adafruit M0 LoRa support by declaring 
///              bitOrder variable always as a unsigned char. Reported by Guilherme Jardim.<br>
///              In RH_RF95, all modes now have AGC enabled, as suggested by Dieter Kneffel.<br>
///
/// \author  Mike McCauley. DO NOT CONTACT THE AUTHOR DIRECTLY. USE THE GOOGLE LIST GIVEN ABOVE

/*! \page packingdata 
\par Passing Sensor Data Between RadioHead nodes

People often ask about how to send data (such as numbers, sensor
readings etc) from one RadioHead node to another. Although this issue
is not specific to RadioHead, and more properly lies in the area of
programming for networks, we will try to give some guidance here.

